[
  {
    "title": "Alyssa Nakken, SF Giants setting example for girls and for boys",
    "description": "Yes, it's important for girls to see Alyssa Nakken on an MLB field. But it's just as important for boys to see it, too.",
    "content": "When Alyssa Nakken stepped into the first base coach’s box in the third inning Tuesday night, it was a moment worth celebrating.\nThere’s now been a woman in an on-field role in a regular season Major League Baseball game, a glass ceiling-shattering t... [5438 chars]",
    "url": "https://www.mercurynews.com/2022/04/14/simon-alyssa-nakken-sf-giants-not-just-setting-example-for-girls-its-for-boys-too/",
    "image": "https://www.mercurynews.com/wp-content/uploads/2022/04/BNG-L-GIANTS-0413-16.jpg?w=1024&h=683",
    "publishedAt": "2022-04-14T18:45:13Z",
    "source": {
      "name": "The Mercury News",
      "url": "https://www.mercurynews.com"
    }
  },
  {
    "title": "Vanessa Bryant Refuses to Settle Kobe Bryant Crash Lawsuit to “Make an Example” for the Future Generations",
    "description": "A new twist emerges in the long running lawsuit involving Vanessa Bryant regarding the unfortunate death of Kobe Bryant. Details inside.",
    "content": "Published 04/14/2022, 11:30 AM EDT\nIn one of the biggest lawsuits concerning the world of basketball currently, wife of late NBA legend Kobe Bryant, Vanessa, fell out with LA County. The lawsuit started after the Los Angeles Lakers legend’s death. Ac... [2412 chars]",
    "url": "https://www.essentiallysports.com/vanessa-bryant-refuses-to-settle-kobe-bryant-crash-lawsuit-to-make-an-example-for-the-future-generations/",
    "image": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200531120911/Vanessa-Bryant.jpg",
    "publishedAt": "2022-04-14T15:30:47Z",
    "source": {
      "name": "Essentially Sports",
      "url": "https://www.essentiallysports.com"
    }
  },
  {
    "title": "Tennessee state senator offers Hitler as inspiration to homeless",
    "description": "A Tennessee state senator on Wednesday used Adolf Hitler as an example of inspiration and hope for the homeless during a speech on the floor of the state’s upper chamber. Tennessee state Sen. Frank S. Niceley (R) made his remarks on the Senate floor during a debate on a bill to make camping or soliciting…",
    "content": "A Tennessee state senator on Wednesday used Adolf Hitler as an example of inspiration and hope for the homeless during a speech on the floor of the state’s upper chamber.\nTennessee state Sen. Frank S. Niceley (R) made his remarks on the Senate floor ... [1949 chars]",
    "url": "https://thehill.com/news/state-watch/3267283-tennessee-state-senator-offers-hitler-as-inspiration-to-homeless/",
    "image": "https://thehill.com/wp-content/uploads/sites/2/2017/01/statecapitolbuildings_tennessee_nashville_thinkstock.jpg?w=1280",
    "publishedAt": "2022-04-14T14:56:28Z",
    "source": {
      "name": "The Hill",
      "url": "https://thehill.com"
    }
  },
  {
    "title": "Dismissing more moderate voices, Biden is Putin's accuser-in-chief",
    "description": "A \"war criminal\" and \"butcher\" who \"cannot remain in power\": over recent weeks, US President Joe Biden has steadily escalated his attacks on Russia's Vladimir Putin -- at the risk of wrong-footing allies, and even his own team.The latest, most striking example: Biden's accusation of a Russian \"genoc...",
    "content": "Herbster, the CEO of Conklin Co. and now a frontrunner in the 2022 GOP primary race, sometimes went further, according to eight women who spoke with the Nebraska Examiner.\nDuring an event in 2019, for example, Republican State Sen. Julie Slama confir... [9623 chars]",
    "url": "https://www.rawstory.com/dismissing-more-moderate-voices-biden-is-putin-s-accuser-in-chief/",
    "image": "https://www.rawstory.com/media-library/image.jpg?id=29681182&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
    "publishedAt": "2022-04-14T14:03:16Z",
    "source": {
      "name": "Raw Story",
      "url": "https://www.rawstory.com"
    }
  },
  {
    "title": "Ferrari 296 GT3 Race Car Spied Lapping Fiorano Test Track On Video",
    "description": "Racing is a vital part of Ferrari's brand image. As an example, here's a video of the upcoming Ferrari 296 GT3 under development at the Fiorano test track.",
    "content": "‎Racing is a vital part of Ferrari's brand image, and that goes well beyond just Formula One. As an example, here's a video of the upcoming Ferrari 296 GT3 under development at the brand's Fiorano test track.\nThis is a much better look at the 296 GT3... [2067 chars]",
    "url": "https://www.motor1.com/news/580016/ferrari-296-gt3-spied-lapping-fiorano-test-track/",
    "image": "https://cdn.motor1.com/images/mgl/7ZLq6J/s1/ferrari-296-gt3-race-car-spy-video.jpg",
    "publishedAt": "2022-04-14T12:53:00Z",
    "source": {
      "name": "Motor1 ",
      "url": "https://www.motor1.com"
    }
  },
  {
    "title": "Judge tosses case after finding Brampton traffic stop ‘infected by racial profiling’",
    "description": "Ruling argues Peel police officer’s actions were an example of Charter infringement that is ‘corrosive and ever-present’",
    "content": "A Brampton judge has dismissed charges against a man who was found driving without a valid licence because the Peel Regional Police officer who made the stop was found to have racially profiled the driver.\nAccording to court documents, on Sept. 17, 2... [3254 chars]",
    "url": "https://www.thestar.com/local-brampton/news/2022/04/14/judge-tosses-case-after-finding-brampton-traffic-stop-infected-by-racial-profiling.html",
    "image": "https://images.thestar.com/oVKUCuMEJTJu-brpd_f1eHYAHJg=/1086x1086/smart/filters:cb(2700061000)/https://www.thestar.com/content/dam/localcommunities/brampton_guardian/news/2022/04/14/judge-tosses-case-after-finding-brampton-traffic-stop-infected-by-racial-profiling/9645836_ShelburnePoliceFilephoto.JPG",
    "publishedAt": "2022-04-14T07:00:00Z",
    "source": {
      "name": "Toronto Star",
      "url": "https://www.thestar.com"
    }
  },
  {
    "title": "Beanstock, a buy-to-let investment marketplace raises €12M Series A led by 360 Capital",
    "description": "Startups which create platforms making it easier to buy “buy to let” properties are proliferating. In the US there is Roofstock, Mynd, Awning and Doorvest, among others. In Europe, there is, for example, GetGround or Bricklane. Beanstock.fr, a French buy-to-let investment marketplace that allows individuals to buy and manage properties online, has made hay as Spanish, English, […]",
    "content": "Startups which create platforms making it easier to buy “buy to let” properties are proliferating. In the US there is Roofstock, Mynd, Awning and Doorvest, among others. In Europe, there is, for example, GetGround or Bricklane. Beanstock.fr, a French... [1621 chars]",
    "url": "https://techcrunch.com/2022/04/14/beanstock-a-buy-to-let-investment-marketplace-raises-e12m-series-a-led-by-360-capital/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/04/1920px-Townhouses_in_Victoria_Australia.jpeg?w=576",
    "publishedAt": "2022-04-14T04:01:26Z",
    "source": {
      "name": "TechCrunch",
      "url": "https://techcrunch.com"
    }
  },
  {
    "title": "Giving birth while Black should not be a death sentence",
    "description": "The circumstances Black people face are not simply a matter of an economic or education system, but of a system that reinforces inequitable and discriminatory practices. There’s no clearer example than that of Serena Williams.",
    "content": "The circumstances Black people face are not simply a matter of an economic or education system, but of a system that reinforces inequitable and discriminatory practices. There’s no clearer example than that of Serena Williams, who despite being one o... [5091 chars]",
    "url": "https://www.bostonglobe.com/2022/04/14/opinion/giving-birth-while-black-should-not-be-death-sentence/",
    "image": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/GIpaTLTRBfVeTmC5ozLgn8n7Fr8=/506x0/cloudfront-us-east-1.images.arcpublishing.com/bostonglobe/GHSBQGPQPREF5HUMQ5XWY25AIU.jpg",
    "publishedAt": "2022-04-14T04:00:00Z",
    "source": {
      "name": "The Boston Globe",
      "url": "https://www.bostonglobe.com"
    }
  },
  {
    "title": "Vladimir Guerrero Jr. wills Blue Jays to win over Yankees with 3 home runs",
    "description": "Bloodied, but far from broken, it was another example of how Guerrero has the talent to single-handedly will his team to a win.",
    "content": "NEW YORK — Even when Vladimir Guerrero Jr. ’s finger was gushing blood, he told his manager that he wasn’t coming out of the game.Moments before, New York Yankees outfielder Aaron Hicks had unknowingly stepped on the Blue Jays first baseman’s throwin... [1012 chars]",
    "url": "https://theathletic.com/3249284/2022/04/14/vladimir-guerrero-blue-jays-3-home-runs/",
    "image": "https://cdn.theathletic.com/app/uploads/2022/04/14005611/AP22104062667952-1024x683.jpg",
    "publishedAt": "2022-04-14T04:00:00Z",
    "source": {
      "name": "The Athletic",
      "url": "https://theathletic.com"
    }
  },
  {
    "title": "Mastercard and Nexo release \"crypto-backed\" credit card",
    "description": "For example, the card doesn't require a minimum monthly repayment, nor will you incur usage or inactivity fees. Additionally, there's no set credit limit -- instead, you...",
    "content": "In brief: Mastercard and Nexo have teamed up to create a new type of credit card: one that doesn't rely on credit scores and credit limits to function. Instead, the card is unique in that it allows you to borrow against the value of your own assets. ... [1580 chars]",
    "url": "https://www.techspot.com/news/94190-nexo-partners-mastercard-release-crypto-backed-credit-card.html",
    "image": "https://static.techspot.com/images2/news/bigimage/2022/04/2022-04-13-image-52.jpg",
    "publishedAt": "2022-04-13T20:49:00Z",
    "source": {
      "name": "TechSpot",
      "url": "https://www.techspot.com"
    }
  }
]
